Домашние инвестиции/src/DataProcessors/ЗагрузкаКурсовВалют_ЦБРФ/ЗагрузкаКурсовВалют_ЦБРФ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>ЗагрузкаКурсовВалют_ЦБРФ</name>
</mdclass:DataProcessor>

Домашние инвестиции/src/InformationRegisters/КурсыВалют/КурсыВалют.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>КурсыВалют</name>
  <informationRegisterPeriodicity>Second</informationRegisterPeriodicity>
  <resources>
    <name>Курс</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>4</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Кратность</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>4</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Валюта</name>
    <type>
      <types>CatalogRef.Валюты</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Домашние инвестиции/src/Catalogs/Валюты/Валюты.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Валюты</name>
  <attributes>
    <name>ПолноеНаименование</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Использовать</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
</mdclass:Catalog>

Домашние инвестиции/src/DataProcessors/ЗагрузкаКурсовВалют_ЦБРФ/ObjectModule.bsl
//*************
//Модуль обработки должен содержать Функции:
//	1  Функция ОписаниеМодуля() - возвращает структуру с описанием модуля 
//	2. Функция ЗагрузитьВсеКурсыВалют(НачалоПериода, КонецПериода) - загружает данные с ресурса по выбранной валюте за выбранный период 
//	3. Функция ЗагрузитьКурсыВалюты(НачалоПериода, КонецПериода, Валюты) - загружает данные с ресурса по выбранной валюте за выбранный период 
//  34. Функция ПолучитьСписокВалютИзКлассификатора() - возвращает список валют, которые есть в классификаторе
//
//*************


#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

Функция ОписаниеМодуля() Экспорт
	
	ОписаниеМодуля = Новый Структура;
	ОписаниеМодуля.Вставить("Версия", "1.0");
	ОписаниеМодуля.Вставить("Заголовок", НСтр("ru = 'Загрузка курсов валют с сайта ЦБРФ'"));
	ОписаниеМодуля.Вставить("Описание", НСтр("ru = 'Загрузка курсов валют с сайта Центрального Банка РФ'"));
	ОписаниеМодуля.Вставить("ВидОбработки", "ДополнительныеМодуль");
	ОписаниеМодуля.Вставить("ФункцииМодуля", "ЗагрузкаКурсовВалют");
	
	Возврат ОписаниеМодуля;

КонецФункции

// Выполняет загрузку официальных курсов иностранных валют с сайта Центрального Банка РФ за указанный период.
// Процедура обрабатывает каждую дату в диапазоне, формирует запрос к внешнему ресурсу, разбирает полученный XML-ответ
// и сохраняет актуальные данные о курсах в регистре сведений "КурсыВалют".
// Загрузка выполняется только для валют, отмеченных флагом "Использовать" в соответствующем справочнике.
//
// Параметры:
//   НачалоПериода - Дата - Начальная дата диапазона, за который необходимо загрузить курсы. Включительно.
//   КонецПериода - Дата - Конечная дата диапазона, за который необходимо загрузить курсы. Включительно.
Процедура ЗагрузитьВсеКурсыВалют(НачалоПериода, КонецПериода) Экспорт
	
	Заголовок = "Загрузка курса валют";
	ГруппаОшибок = "Загрузка курсов валют";
	
	// 0. Подготовка: получаем список валют, для которых нужно загрузить курсы
	СписокВалютДляЗагрузки = Новый Соответствие;
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Валюты.Ссылка КАК Валюта,
		|	Валюты.Код КАК ЦифровойКод
		|ИЗ
		|	Справочник.Валюты КАК Валюты
		|ГДЕ
		|	Валюты.Использовать = ИСТИНА
		|	И НЕ Валюты.ПометкаУдаления";
	// ВАЖНО: Убедитесь, что реквизит "Использовать" существует в справочнике.
	
	РезультатЗапроса = Запрос.Выполнить();
	Выборка = РезультатЗапроса.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		// Заполняем соответствие, где ключ - цифровой код из справочника,
		// а значение - ссылка на элемент справочника
		СписокВалютДляЗагрузки.Вставить(Выборка.ЦифровойКод, Выборка.Валюта);
	КонецЦикла;
	
	Если СписокВалютДляЗагрузки.Количество() = 0 Тогда
		ОбработкаОшибокКлиентСервер.СообщитьОписаниеОшибки(Заголовок, "В справочнике 'Валюты' не найдено элементов с установленным флагом 'Использовать'. Загрузка отменена.");
		Возврат;
	КонецЕсли;

	// 1. Основной цикл по датам в указанном периоде
	ТекущаяДата = НачалоПериода;
	ВсегоЗагружено = 0;
	
	Пока ТекущаяДата <= КонецПериода Цикл
		
		// 1.1. Определяем формат даты в зависимости от периода.
		// Для дат до 01.07.2010 используется формат "dd/MM/yyyy",
		// для более поздних - "dd.MM.yyyy".
		ГраницаФормата = Дата(2010, 7, 1);
		Если ТекущаяДата < ГраницаФормата Тогда
			ДатаФормат = Формат(ТекущаяДата, "ДФ=dd/MM/yyyy");
		Иначе
			ДатаФормат = Формат(ТекущаяДата, "ДФ=dd.MM.yyyy");
		КонецЕсли;
		
		// 2. Формируем адрес для запроса для текущей даты
		АдресРесурса = "www.cbr.ru";
		URLЗапроса = "/scripts/XML_daily.asp?date_req=";
	
		// 3. Создаем HTTP-соединение и отправляем запрос для текущей даты
		Попытка
			HTTPСоединение = Новый HTTPСоединение(АдресРесурса);
			HTTPЗапрос = Новый HTTPЗапрос(URLЗапроса + ДатаФормат);
			HTTPОтвет = HTTPСоединение.Получить(HTTPЗапрос);
			
			Если HTTPОтвет.КодСостояния <> 200 Тогда
				ОбработкаОшибокКлиентСервер.СообщитьОбОшибке(Заголовок, "Сервер ЦБ РФ вернул ошибку за дату " + ТекущаяДата + ". Код: " + HTTPОтвет.КодСостояния);
				// Переходим к следующей дате в случае ошибки
				ТекущаяДата = ТекущаяДата + 86400; // Прибавляем 1 день в секундах
				Продолжить;
			КонецЕсли;
			
			ЧтениеXML = Новый ЧтениеXML;
			ЧтениеXML.УстановитьСтроку(HTTPОтвет.ПолучитьТелоКакСтроку());
			
		Исключение
			ИнформацияОбОшибке = ИнформацияОбОшибке();
			ОбработкаОшибокКлиентСервер.СообщитьОбОшибке(Заголовок, "Ошибка при подключении к сайту ЦБ РФ за дату " + ТекущаяДата + ": " + ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке), ГруппаОшибок);
			// Переходим к следующей дате в случае ошибки
			ТекущаяДата = ТекущаяДата + 86400; // Прибавляем 1 день в секундах
			Продолжить;
		КонецПопытки;
		
		// 6. Парсим XML для текущей даты
		Попытка
			
			Пока ЧтениеXML.Прочитать() Цикл
				Если ЧтениеXML.Имя = "Valute" И ЧтениеXML.ТипУзла = ТипУзлаXML.НачалоЭлемента Тогда
					
					NumCode = ""; Номинал = ""; Значение = "";
					
					// Читаем дочерние узлы элемента Valute
					Пока ЧтениеXML.Прочитать() Цикл
						Если ЧтениеXML.ТипУзла = ТипУзлаXML.КонецЭлемента И ЧтениеXML.Имя = "Valute" Тогда
							Прервать;
						КонецЕсли;
						
						Если ЧтениеXML.ТипУзла = ТипУзлаXML.НачалоЭлемента Тогда
							ИмяЭлемента = ЧтениеXML.Имя;
							ЧтениеXML.Прочитать();
							ЗначениеЭлемента = СокрЛП(ЧтениеXML.Значение);
							
							Если ИмяЭлемента = "NumCode" Тогда
								NumCode = ЗначениеЭлемента;
							ИначеЕсли ИмяЭлемента = "Nominal" Тогда
								Номинал = ЗначениеЭлемента;
							ИначеЕсли ИмяЭлемента = "Value" Тогда
								Значение = ЗначениеЭлемента;
							КонецЕсли;
						КонецЕсли;
					КонецЦикла;
					
					// 7. Проверяем, нужна ли нам эта валюта
					НайденнаяВалюта = СписокВалютДляЗагрузки.Получить(NumCode);
					
					// Если валюта найдена в нашем подготовленном списке
					Если НайденнаяВалюта <> Неопределено И Номинал <> "" И Значение <> "" Тогда
						Курс = Число(СтрЗаменить(Значение, ",", "."));
						Кратность = Число(СтрЗаменить(Номинал, ".", ","));
						Попытка
							РегистрыСведений.КурсыВалют.ЗаписатьКурсВалюты(ТекущаяДата, НайденнаяВалюта, Курс, Кратность);
							ВсегоЗагружено = ВсегоЗагружено + 1;
						Исключение
							ОбработкаОшибокКлиентСервер.СообщитьОбОшибке(Заголовок, СтрШаблон("Не удалось загрузить курс валюты с кодом %1 на дату %2 по причине: %3", NumCode, ТекущаяДата, ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке)), ГруппаОшибок);
						КонецПопытки;
					КонецЕсли;
					
				КонецЕсли;
			КонецЦикла;
			
			ЧтениеXML.Закрыть();
			
		Исключение
			ОбработкаОшибокКлиентСервер.СообщитьОбОшибке(Заголовок, СтрШаблон("Ошибка при разборе XML от ЦБ РФ за дату %2 по причине: %3", ТекущаяДата, ОписаниеОшибки()), ГруппаОшибок);
		КонецПопытки;
		
		// Переходим к следующей дате
		ТекущаяДата = ТекущаяДата + 86400; // Прибавляем 1 день в секундах
		
	КонецЦикла;
	
	ОбщегоНазначенияКлиентСервер.СообщитьПользователю(СтрШаблон("Загрузка курсов валют за период с %1 по %2 завершена. Всего загружено записей: %3", НачалоПериода, КонецПериода, ВсегоЗагружено),,,,);

КонецПроцедуры

// Загружает курсы валют с сайта Центрального Банка РФ за указанный период
//
// Параметры:
//  НачалоПериода - Дата - дата начала периода загрузки
//  КонецПериода - Дата - дата окончания периода загрузки
//  Валюта - СправочникСсылка.Валюты - валюта, курс которой нужно загрузить
//
Процедура ЗагрузитьКурсыВалюты(НачалоПериода, КонецПериода, Валюта) Экспорт
	
	Заголовок = "Загрузка курса валют";
	ГруппаОшибок = "Загрузка курсов валют";
	
	// 0. Подготовка: получаем список валют, для которых нужно загрузить курсы
	СписокВалютДляЗагрузки = Новый Соответствие;
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Валюты.Ссылка КАК Валюта,
		|	Валюты.Код КАК ЦифровойКод
		|ИЗ
		|	Справочник.Валюты КАК Валюты
		|ГДЕ
		|	Валюты.Ссылка = &Валюта";
	Запрос.УстановитьПараметр("Валюта", Валюта);
	
	// ВАЖНО: Убедитесь, что реквизит "Использовать" существует в справочнике.
	
	РезультатЗапроса = Запрос.Выполнить();
	Выборка = РезультатЗапроса.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		// Заполняем соответствие, где ключ - цифровой код из справочника,
		// а значение - ссылка на элемент справочника
		СписокВалютДляЗагрузки.Вставить(Выборка.ЦифровойКод, Выборка.Валюта);
	КонецЦикла;
	
	Если СписокВалютДляЗагрузки.Количество() = 0 Тогда
		ОбработкаОшибокКлиентСервер.СообщитьОписаниеОшибки(Заголовок, "В справочнике 'Валюты' не найдено элементов с установленным флагом 'Использовать'. Загрузка отменена.");
		Возврат;
	КонецЕсли;

	// 1. Основной цикл по датам в указанном периоде
	ТекущаяДата = НачалоПериода;
	ВсегоЗагружено = 0;
	
	Пока ТекущаяДата <= КонецПериода Цикл
		
		// 1.1. Определяем формат даты в зависимости от периода.
		// Для дат до 01.07.2010 используется формат "dd/MM/yyyy",
		// для более поздних - "dd.MM.yyyy".
		ГраницаФормата = Дата(2010, 7, 1);
		Если ТекущаяДата < ГраницаФормата Тогда
			ДатаФормат = Формат(ТекущаяДата, "ДФ=dd/MM/yyyy");
		Иначе
			ДатаФормат = Формат(ТекущаяДата, "ДФ=dd.MM.yyyy");
		КонецЕсли;
		
		// 2. Формируем адрес для запроса для текущей даты
		АдресРесурса = "www.cbr.ru";
		URLЗапроса = "/scripts/XML_daily.asp?date_req=";
	
		// 3. Создаем HTTP-соединение и отправляем запрос для текущей даты
		Попытка
			HTTPСоединение = Новый HTTPСоединение(АдресРесурса);
			HTTPЗапрос = Новый HTTPЗапрос(URLЗапроса + ДатаФормат);
			HTTPОтвет = HTTPСоединение.Получить(HTTPЗапрос);
			
			Если HTTPОтвет.КодСостояния <> 200 Тогда
				ОбработкаОшибокКлиентСервер.СообщитьОбОшибке(Заголовок, "Сервер ЦБ РФ вернул ошибку за дату " + ТекущаяДата + ". Код: " + HTTPОтвет.КодСостояния);
				// Переходим к следующей дате в случае ошибки
				ТекущаяДата = ТекущаяДата + 86400; // Прибавляем 1 день в секундах
				Продолжить;
			КонецЕсли;
			
			ЧтениеXML = Новый ЧтениеXML;
			ЧтениеXML.УстановитьСтроку(HTTPОтвет.ПолучитьТелоКакСтроку());
			
		Исключение
			ИнформацияОбОшибке = ИнформацияОбОшибке();
			ОбработкаОшибокКлиентСервер.СообщитьОбОшибке(Заголовок, "Ошибка при подключении к сайту ЦБ РФ за дату " + ТекущаяДата + ": " + ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке), ГруппаОшибок);
			// Переходим к следующей дате в случае ошибки
			ТекущаяДата = ТекущаяДата + 86400; // Прибавляем 1 день в секундах
			Продолжить;
		КонецПопытки;
		
		// 6. Парсим XML для текущей даты
		Попытка
			
			Пока ЧтениеXML.Прочитать() Цикл
				Если ЧтениеXML.Имя = "Valute" И ЧтениеXML.ТипУзла = ТипУзлаXML.НачалоЭлемента Тогда
					
					NumCode = ""; Номинал = ""; Значение = "";
					
					// Читаем дочерние узлы элемента Valute
					Пока ЧтениеXML.Прочитать() Цикл
						Если ЧтениеXML.ТипУзла = ТипУзлаXML.КонецЭлемента И ЧтениеXML.Имя = "Valute" Тогда
							Прервать;
						КонецЕсли;
						
						Если ЧтениеXML.ТипУзла = ТипУзлаXML.НачалоЭлемента Тогда
							ИмяЭлемента = ЧтениеXML.Имя;
							ЧтениеXML.Прочитать();
							ЗначениеЭлемента = СокрЛП(ЧтениеXML.Значение);
							
							Если ИмяЭлемента = "NumCode" Тогда
								NumCode = ЗначениеЭлемента;
							ИначеЕсли ИмяЭлемента = "Nominal" Тогда
								Номинал = ЗначениеЭлемента;
							ИначеЕсли ИмяЭлемента = "Value" Тогда
								Значение = ЗначениеЭлемента;
							КонецЕсли;
						КонецЕсли;
					КонецЦикла;
					
					// 7. Проверяем, нужна ли нам эта валюта
					НайденнаяВалюта = СписокВалютДляЗагрузки.Получить(NumCode);
					
					// Если валюта найдена в нашем подготовленном списке
					Если НайденнаяВалюта <> Неопределено И Номинал <> "" И Значение <> "" Тогда
						Курс = Число(СтрЗаменить(Значение, ",", "."));
						Кратность = Число(СтрЗаменить(Номинал, ".", ","));
						Попытка
							РегистрыСведений.КурсыВалют.ЗаписатьКурсВалюты(ТекущаяДата, НайденнаяВалюта, Курс, Кратность);
							ВсегоЗагружено = ВсегоЗагружено + 1;
						Исключение
							ОбработкаОшибокКлиентСервер.СообщитьОбОшибке(Заголовок, СтрШаблон("Не удалось загрузить курс валюты с кодом %1 на дату %2 по причине: %3", NumCode, ТекущаяДата, ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке)), ГруппаОшибок);
						КонецПопытки;
					КонецЕсли;
					
				КонецЕсли;
			КонецЦикла;
			
			ЧтениеXML.Закрыть();
			
		Исключение
			ОбработкаОшибокКлиентСервер.СообщитьОбОшибке(Заголовок, СтрШаблон("Ошибка при разборе XML от ЦБ РФ за дату %2 по причине: %3", ТекущаяДата, ОписаниеОшибки()), ГруппаОшибок);
		КонецПопытки;
		
		// Переходим к следующей дате
		ТекущаяДата = ТекущаяДата + 86400; // Прибавляем 1 день в секундах
		
	КонецЦикла;
	
	ОбщегоНазначенияКлиентСервер.СообщитьПользователю(СтрШаблон("Загрузка курсов валют за период с %1 по %2 завершена. Всего загружено записей: %3", НачалоПериода, КонецПериода, ВсегоЗагружено),,,,);

КонецПроцедуры

// Получает полный список валют из XML-классификатора, предоставляемого сайтом ЦБ РФ.
//
// Возвращаемое значение:
//   СписокЗначений - Список структур, каждая из которых содержит СимвольныйКод, ПолноеНаименование и ЦифровойКод валюты. В случае ошибки возвращает Неопределено.
//
Функция ПолучитьСписокВалютИзКлассификатора() Экспорт
	
	СписокДляВыбора = Новый СписокЗначений;
	
	// 1. Получаем XML-текст от ЦБ РФ
	Попытка
		HTTPСоединение = Новый HTTPСоединение("www.cbr.ru", , , , , , Новый ЗащищенноеСоединениеOpenSSL());
		HTTPЗапрос = Новый HTTPЗапрос("/scripts/XML_valFull.asp");
		HTTPОтвет = HTTPСоединение.Получить(HTTPЗапрос);
		
		Если HTTPОтвет.КодСостояния <> 200 Тогда
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Ошибка при запросе к сайту ЦБ РФ: " + HTTPОтвет.КодСостояния);
			Возврат Неопределено;
		КонецЕсли;
		
		ТекстXML = HTTPОтвет.ПолучитьТелоКакСтроку();
		
	Исключение
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Ошибка при подключении к сайту ЦБ РФ: " + ОписаниеОшибки());
		Возврат Неопределено;
	КонецПопытки;
	
	// 2. Надежный и простой парсинг XML с помощью ЧтениеXML
	ЧтениеXML = Новый ЧтениеXML;
	ЧтениеXML.УстановитьСтроку(ТекстXML);
	ЧтениеXML.ИгнорироватьПробелы = Истина; // Игнорировать узлы с пробелами
	
	Пока ЧтениеXML.Прочитать() Цикл
		
		// Ищем начало элемента <Item>
		Если ЧтениеXML.ТипУзла = ТипУзлаXML.НачалоЭлемента И ЧтениеXML.Имя = "Item" Тогда
			
			СимвольныйКод = "";
			ПолноеНаименование = "";
			ЦифровойКод = "";
			
			// Получаем значение атрибута "Name" напрямую
			ПолноеНаименование = СокрЛП(ЧтениеXML.ЗначениеАтрибута("Name"));
			
			// Читаем все дочерние узлы элемента <Item>
			Пока ЧтениеXML.Прочитать() Цикл
				
				// Как только встретили конец </Item>, выходим из внутреннего цикла
				Если ЧтениеXML.ТипУзла = ТипУзлаXML.КонецЭлемента И ЧтениеXML.Имя = "Item" Тогда
					Прервать;
				КонецЕсли;
				
				// Если это начало тега, который нам нужен...
				Если ЧтениеXML.ТипУзла = ТипУзлаXML.НачалоЭлемента Тогда
					ИмяТега = ЧтениеXML.Имя;
					
					// ...то читаем следующий узел, который будет текстом
					Если ЧтениеXML.Прочитать() Тогда
						ЗначениеТега = СокрЛП(ЧтениеXML.Значение);
						
						Если ИмяТега = "Name" Тогда
							ПолноеНаименование = ЗначениеТега;
						ИначеЕсли ИмяТега = "ISO_Char_Code" Тогда
							СимвольныйКод = ЗначениеТега;
						ИначеЕсли ИмяТега = "ISO_Num_Code" Тогда
							ЦифровойКод = ЗначениеТега;
						КонецЕсли;
					КонецЕсли;
				КонецЕсли;
			КонецЦикла;
			
			// Если все данные собраны, добавляем в список
			Если Не ПустаяСтрока(СимвольныйКод) И Не ПустаяСтрока(ЦифровойКод) И Не ПустаяСтрока(ПолноеНаименование) Тогда
				СтруктураДанных = Новый Структура("СимвольныйКод, ПолноеНаименование, ЦифровойКод", СимвольныйКод, ПолноеНаименование, ЦифровойКод);
				СписокДляВыбора.Добавить(СтруктураДанных, ПолноеНаименование);
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	
	ЧтениеXML.Закрыть();
	
	Возврат СписокДляВыбора;
	
КонецФункции


#КонецОбласти

#Область ОбработчикиСобытий

// Код процедур и функций

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

// Код процедур и функций

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Код процедур и функций

#КонецОбласти

#КонецЕсли
